# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
# У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,
# то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2]
my_list = [7, 5, 3, 3, 2]
while True:
    rate = input('введите натуральное число\n')
    if rate.isdigit() and int(rate)>=0:
        rate = int(rate)
        break
for y,i in enumerate(my_list):
    if rate >= i:
        my_list.insert((my_list.index(i)),rate)
        break
    elif y != len(my_list) - 1:
        continue
    else:
        my_list.append(rate)
        break
print(my_list)